#pragma once

//----------------------------------------------------------------------------------------------
//自作ファイル



//----------------------------------------------------------------------------------------------

namespace tpr {
	class Route {
	public:

		//------------------------------------------------------------------------------------------
		//関数

		Route() {};
		~Route() {};




	private:

		//------------------------------------------------------------------------------------------
		//X座標Y座標の管理
		class Position {
		public:

			Position() :x(0), y(0) {}
			Position(int _x, int _y) :x(_x), y(_y) {}
			int x;
			int y;
			//↑これらは初期化の少し早い方法

			Position operator +(Position p) {
				
				return Position(x + p.x, y + p.y);
			}

			bool operator ==(Position p){
				
				if (x == p.x && y == p.y) { return true; }
				return false;
			}
		};
	};
}