#pragma once


//----------------------------------------------------------------------------------------------------
//自作ファイル

#include "Object.h"


//----------------------------------------------------------------------------------------------------

class CharaObj :public Object {
public:

	//------------------------------------------------------------------------------------------------
	//関数



	//------------------------------------------------------------------------------------------------
	//変数

	static constexpr int name_length = 11;  //名前の長さ
	static constexpr int status_value = 5;  //ステータスの数

	

	//ステータス

	char name[name_length] = { 0 };  //名前　※10文字

	class Status {
	public:

		int HP;                     //ヒットポイント
		int move_speed;             //移動速度
		int attack;                 //攻撃力
		int defense;                //防御力
		int attack_speed;           //攻撃速度      一秒間に何回攻撃するか
	};

	Status sta;

	float timecount = 0;

	//------------------------------------------------------------------------------------------------
};