#pragma once
#include "DxLib.h"
#include <list>

//----------------------------------------------------------------------------------------------------
//自作ファイル

#include "Object.h"
#include "Camera.h"
#include "Player.h"
#include "Bullet.h"
#include "Enemy.h"


//----------------------------------------------------------------------------------------------------

class GameManager {
public:

	//------------------------------------------------------------------------------------------------
	//関数

	GameManager();
	void Init();     //初期化

	void Delete();   //削除


	//------------------------------------------------------------------------------------------------
	//変数

	bool _init = true; //初期化フラグ


	//------------------------------------------------------------------------------------------------
	//スクリーンサイズ

	static constexpr int SCREEN_W = 1024;
	static constexpr int SCREEN_H = 768;


	//------------------------------------------------------------------------------------------------
	//リスト　ポインタ

	std::list<Object*>Op;   //Objectクラス
	Player* Pp = nullptr;   //Playerクラス
	std::list<Bullet*>Bp;   //Bulletクラス

	Camera cam;             //Cameraクラス


	//------------------------------------------------------------------------------------------------
	//毎フレーム呼び出し

	void Update(float deltatime);
	void Render(float deltatime);


	//------------------------------------------------------------------------------------------------
};