#pragma once

#include "../library/t2klib.h"
#include "DxLib.h"


//----------------------------------------------------------------------------------------------------
//自作ファイル

#include "Camera.h"
#include "TPRlib/tpr_library.h"


//----------------------------------------------------------------------------------------------------

class Object {
public:

	//------------------------------------------------------------------------------------------------
	//関数

	virtual ~Object() {};


	//------------------------------------------------------------------------------------------------
	//変数

	t2k::Vector3 pos;          //座標
	int r;                     //当たり判定用の半径
	int size_w;                //当たり判定用の幅
	int size_h;                //当たり判定用の高さ
	bool alive_flag = true;    //生存フラグ
	bool _team;                //陣営
	int img = 0;               //画像


	//------------------------------------------------------------------------------------------------
	//毎フレーム呼び出し

	virtual void Update(float deltatime) {};
	virtual void Update(float deltatime, tpr::Vector2 pos_) {};
	virtual void Render(Camera* cam) {};


	//------------------------------------------------------------------------------------------------
};