#pragma once


//---------------------------------------------------------------------------------------------
//自作ファイル

#include "Vector2.h"


//---------------------------------------------------------------------------------------------

namespace tpr {

	//角度
	class Angle {
	public:

		//-------------------------------------------------------------------------------------
		//コンストラクタ

		Angle() {};


		//-------------------------------------------------------------------------------------
		//関数

		//=======================================================
		// 二点間の角度を計算
		// 1. 始点
		// 2. 終点
		// 
		// return 弧度法の角度
		//=======================================================
		static float RadCalc(Vector2 start_pos, Vector2 end_pos);

		//=======================================================
		// 二点間の角度を計算
		// 1. 始点
		// 2. 終点
		// 
		// return 度数法の角度
		//=======================================================
		static int DegCalc(Vector2 start_pos, Vector2 end_pos);

		//=======================================================
		// 度数法を弧度法に直す
		// 1. 度数法の角度
		// 
		// return 弧度法の角度
		//=======================================================
		static float DegChangeRad(int degree);

		//=======================================================
		// 弧度法を度数法に直す
		// 1. 弧度法の角度
		// 
		// return 度数法の角度
		//=======================================================
		static int RadChangeDeg(float radian);


	private:

		//=======================================================
		// 点Aを中心にX軸Y軸で分割したとき点Bがどこにいるか
		// 1. 始点
		// 2. 終点
		// 
		// return
		// info 0	X軸またはY軸上にある
		// info 1	右上
		// info 2	左上
		// info 3	左下
		// info 4	右下
		//=======================================================
		inline static int SearchSide(Vector2 start_pos, Vector2 end_pos);


	};
}