#pragma once

//--------------------------------------------------------------------------------------------------
//自作ファイル

#include "Quadrilateral.h"
#include "Line.h"


//--------------------------------------------------------------------------------------------------

namespace tpr {

	//=======================================================
	// 円と円の当たり判定
	// 1. 円AのVector2座標
	// 3. 円Aの半径r
	// 4. 円BのVector2座標
	// 5. 円Bの半径r
	// 
	// return true 当たってる　false 当たってない
	//=======================================================
	bool isHit_CircleAndCircle(Vector2 cA_pos, float cA_r, Vector2 cB_pos, float cB_r);


	//=======================================================
	// 線分と線分の当たり判定
	// 1. 線分A
	// 2. 線分B
	// 
	// return true 当たってる　false 当たってない
	//=======================================================
	bool isHit_LineAndLine(Line first_line, Line second_line);


	//=======================================================
	// 線分と矩形の当たり判定
	// 1. 線分
	// 2. 矩形
	// 
	// return true 当たってる　false 当たってない
	//=======================================================
	bool isHit_LineAndRectangle(Line line, Quadrilateral quad);


	//=======================================================
	// 矩形と矩形の当たり判定
	// 1. 矩形A
	// 2. 矩形B
	// 
	// return true 当たってる　false 当たってない
	//=======================================================
	bool isHit_RectangleAndRectangle(Quadrilateral first_quad, Quadrilateral second_quad);

}