#pragma once
#include "DxLib.h"

//--------------------------------------------------------------------------------------------------
//自作ファイル



//--------------------------------------------------------------------------------------------------

namespace tpr {

	//int型の2次元座標
	class Vector2_int {
	public:

		//-------------------------------------------------------------------------------------
		//コンストラクタ

		//=======================================================
		// 変数宣言のみ
		//=======================================================
		Vector2_int() :
			x(0),
			y(0)
		{}

		//=======================================================
		// 座標指定
		// 1. X座標
		// 2. Y座標
		//=======================================================
		Vector2_int(int _x, int _y) :
			x(_x),
			y(_y)
		{}


		//-------------------------------------------------------------------------------------
		//オペレータ

		Vector2_int operator +(Vector2_int p) {

			return Vector2_int(x + p.x, y + p.y);
		}

		Vector2_int operator -(Vector2_int p) {

			return Vector2_int(x - p.x, y - p.y);
		}

		Vector2_int operator =(Vector2_int p) {

			return Vector2_int(x = p.x, y = p.y);
		}

		bool operator ==(Vector2_int p) {

			if (x == p.x && y == p.y) { return true; }
			return false;
		}

		bool operator !=(Vector2_int p) {

			if (x != p.x || y != p.y) { return true; }
			return false;
		}

		//-------------------------------------------------------------------------------------
		//関数

		void DrawPoint() {
			DrawPixel(x, y, -1);
		}


		//-------------------------------------------------------------------------------------
		//変数

		int x;
		int y;
	};
}